Австралия/src/InformationRegisters/StandardTime/StandardTime.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>StandardTime</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Norm</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <dimensions>
    <name>Products</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Enums/ProductsTypes/ProductsTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ProductsTypes</name>
  <enumValues>
    <name>InventoryItem</name>
  </enumValues>
  <enumValues>
    <name>Service</name>
  </enumValues>
  <enumValues>
    <name>Work</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/InformationRegisters/StandardTime/Forms/ListForm/Module.bsl
#Region ProcedureFormEventHandlers

&AtServer
// Procedure-handler of the OnCreateAtServer event.
// Performs initial attributes forms filling.
//
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("Filter") AND Parameters.Filter.Property("Products") Then

		Products = Parameters.Filter.Products;

		If Products.ProductsType <> Enums.ProductsTypes.Work Then
			
			AutoTitle = False;
			Title = NStr("en = 'Standard hours are stored only for works'; ru = 'Нормы времени хранятся только для работ';pl = 'Normy czasowe są przechowywane tylko dla prac';es_ES = 'Horas estándar se han almacenado solo para trabajos';es_CO = 'Horas estándar se han almacenado solo para trabajos';tr = 'Standart süre sadece işler için saklanır';it = 'Ore standard vengono memorizzate solo per i lavori';de = 'Richtwertsätze werden nur für Arbeiten gespeichert'");

			Items.List.ReadOnly = True;
			
		EndIf;

	EndIf;
		
EndProcedure

#EndRegion
